// Развернуть каждый элемент коллекции в процессор коллекций.
// Позволяет расширить имеющуюся коллекцию.
// Например, разворачивание массива массивов сделает новый массив, содержащий все элементы всех массивов.
// Конвейерный метод.
//
// Параметры:
//  ФункцияРазворачивания - Строка, ОписаниеОповещения - функция разворачивания.
//    В случае передачи Строки формируется служебное описание оповещения, в контексте которого заданы переменные
//    "Результат", "ДополнительныеПараметры", "Элемент".
//    В случае передачи ОписанияОповещения обработчик данного описания должен содержать два параметра
//    (имена произвольные):
//      * Результат - ПроцессорКоллекций - Переменная, в которую должен быть
//                        помещен результат работы функции в виде ПроцессораКоллекций.
//      * ДополнительныеПараметры - Структура - Структура параметров, передаваемая функции разворачивания.
//
//  ДополнительныеПараметры - Структура - Структура дополнительных параметров, передаваемая функции разворачивания.
//    Служит для передачи дополнительных данных из прикладного кода в функцию разворачивания.
//    По умолчанию содержит одно значение - Элемент.
//
// Возвращаемое значение:
//  ПроцессорКоллекций - Инстанс класса "ПроцессорКоллекций".
//
// Примеры:
//  1:
//  ПроцессорКоллекций.Развернуть("Результат = ПроцессорыКоллекций.ИзСтроки(Элемент);");
//
//  2:
//  Процедура МояФункцияРазворачивания(Результат, ДополнительныеПараметры) Экспорт
//    Результат = ПроцессорыКоллекций.ИзСтроки(ДополнительныеПараметры.Элемент);
//  КонецПроцедуры
//
//  ФункцияРазворачивания = Новый ОписаниеОповещения("МояФункцияРазворачивания", ЭтотОбъект);
//  ПроцессорКоллекций.Развернуть(ФункцияРазворачивания);
//
